tests/integration/bajaj/test_data/service_advisor_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
	<SOAP-ENV:Body>
		<ns1:postDealer>
			<ns1:ObjectList>
				<ns1:DealerData>
					<ns1:DealerModel>
						<ns1:ACTIVE_FLAG>Y</ns1:ACTIVE_FLAG>
						<ns1:TIMESTAMP>2005-08-01000000</ns1:TIMESTAMP>
						<ns1:SER_ADV_MOBILE>1111111111</ns1:SER_ADV_MOBILE>
						<ns1:CDMS_FLAG>0</ns1:CDMS_FLAG>
						<ns1:SER_ADV_ID>GMDEALER001SA31</ns1:SER_ADV_ID>
						<ns1:ADDRESS>HSR LAYOUT</ns1:ADDRESS>
						<ns1:SER_ADV_NAME>TestUser31</ns1:SER_ADV_NAME>
						<ns1:KUNNR>GMDEALER031</ns1:KUNNR>
					</ns1:DealerModel>
					<ns1:DealerModel>
						<ns1:ACTIVE_FLAG>Y</ns1:ACTIVE_FLAG>
                        <ns1:TIMESTAMP>2005-08-01000000</ns1:TIMESTAMP>
						<ns1:SER_ADV_MOBILE>5555555555</ns1:SER_ADV_MOBILE>
						<ns1:CDMS_FLAG>1</ns1:CDMS_FLAG>
						<ns1:SER_ADV_ID>GMDEALER001SA32</ns1:SER_ADV_ID>
						<ns1:ADDRESS>HSR LAYOUT</ns1:ADDRESS>
						<ns1:SER_ADV_NAME>TestUser32</ns1:SER_ADV_NAME>
						<ns1:KUNNR>GMDEALER032</ns1:KUNNR>
					</ns1:DealerModel>
                    <ns1:DealerModel>
						<ns1:ACTIVE_FLAG>Y</ns1:ACTIVE_FLAG>
						<ns1:TIMESTAMP>2006-09-01000000</ns1:TIMESTAMP>
						<ns1:SER_ADV_MOBILE>4444444444</ns1:SER_ADV_MOBILE>
						<ns1:CDMS_FLAG>0</ns1:CDMS_FLAG>
						<ns1:SER_ADV_ID>GMDEALER001SA33</ns1:SER_ADV_ID>
						<ns1:ADDRESS>HBR LAYOUT</ns1:ADDRESS>
						<ns1:SER_ADV_NAME>TestUser33</ns1:SER_ADV_NAME>
						<ns1:KUNNR>GMDEALER0033</ns1:KUNNR>
					</ns1:DealerModel>
				</ns1:DealerData>
			</ns1:ObjectList>
			<ns1:Credential>
				<ns1:UserName>bajaj</ns1:UserName>
				<ns1:Password>bajaj</ns1:Password>
			</ns1:Credential>
		</ns1:postDealer>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>